GrumpyOldPizza/ArduinoCore-stm32l0/boards.txt
Cricket-L082CZ.menu.opt.os=Smallest Code
Cricket-L082CZ.menu.opt.os.build.flags.optimize=-Os
Cricket-L082CZ.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
Cricket-L082CZ.menu.opt.o1=Fast
Cricket-L082CZ.menu.opt.o1.build.flags.optimize=-O1
Cricket-L082CZ.menu.opt.o1.build.flags.ldspecs=
Cricket-L082CZ.menu.opt.o2=Faster
Cricket-L082CZ.menu.opt.o2.build.flags.optimize=-O2
Cricket-L082CZ.menu.opt.o2.build.flags.ldspecs=
Cricket-L082CZ.menu.opt.o3=Fastest
Cricket-L082CZ.menu.opt.o3.build.flags.optimize=-O3
Cricket-L082CZ.menu.opt.o3.build.flags.ldspecs=

# Tlera Cicada
# ---------------------------------------
Cicada-L082CZ.name=Cicada-L082CZ
Cicada-L082CZ.vid.0=0x1209
Cicada-L082CZ.pid.0=0x6663

Cicada-L082CZ.upload.tool=stm32l0_dfu
Cicada-L082CZ.upload.protocol=dfu
Cicada-L082CZ.upload.maximum_size=196608
Cicada-L082CZ.upload.maximum_data_size=20480
Cicada-L082CZ.upload.use_1200bps_touch=true
Cicada-L082CZ.upload.wait_for_upload_port=false
Cicada-L082CZ.upload.native_usb=false

Cicada-L082CZ.build.mcu=cortex-m0plus
Cicada-L082CZ.build.f_cpu=32000000L
Cicada-L082CZ.build.board=STM32L0_CICADA
Cicada-L082CZ.build.arch=stm32l0
Cicada-L082CZ.build.core=arduino
Cicada-L082CZ.build.vid=0x1209
Cicada-L082CZ.build.pid=0x6663
Cicada-L082CZ.build.did=0xffff
Cicada-L082CZ.build.usb_manufacturer="Tlera Corporation"
Cicada-L082CZ.build.usb_product="Cicada"
Cicada-L082CZ.build.extra_flags=-DSTM32L082xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant {build.usb_flags} {build.dosfs_flags}
Cicada-L082CZ.build.ldscript=linker_scripts/STM32L082CZ_FLASH.ld
Cicada-L082CZ.build.openocdscript=openocd_scripts/cicada-l082cz.cfg
Cicada-L082CZ.build.variant=Cicada-L082CZ
Cicada-L082CZ.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l082xx -larm_cortexM0l_math
Cicada-L082CZ.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include" 

Cicada-L082CZ.menu.usb.cdc=Serial
Cicada-L082CZ.menu.usb.cdc.build.usb_type=USB_TYPE_CDC
Cicada-L082CZ.menu.usb.cdc_msc=Serial + Mass Storage
Cicada-L082CZ.menu.usb.cdc_msc.build.usb_type=USB_TYPE_CDC_MSC
Cicada-L082CZ.menu.usb.cdc_hid=Serial + Keyboard + Mouse
Cicada-L082CZ.menu.usb.cdc_hid.build.usb_type=USB_TYPE_CDC_HID
Cicada-L082CZ.menu.usb.cdc_msc_hid=Serial + Mass Storage + Keyboard + Mouse
Cicada-L082CZ.menu.usb.cdc_msc_hid.build.usb_type=USB_TYPE_CDC_MSC_HID
Cicada-L082CZ.menu.usb.none=No USB
Cicada-L082CZ.menu.usb.none.build.usb_type=USB_TYPE_NONE

Cicada-L082CZ.menu.dosfs.none=None
Cicada-L082CZ.menu.dosfs.none.build.dosfs_sdcard=0
Cicada-L082CZ.menu.dosfs.none.build.dosfs_sflash=0
Cicada-L082CZ.menu.dosfs.sfspi=SFLASH
Cicada-L082CZ.menu.dosfs.sfspi.build.dosfs_sdcard=0
Cicada-L082CZ.menu.dosfs.sfspi.build.dosfs_sflash=1

Cicada-L082CZ.menu.speed.32=32 MHz
Cicada-L082CZ.menu.speed.32.build.f_cpu=32000000L
Cicada-L082CZ.menu.speed.16=16 MHz (No USB)
Cicada-L082CZ.menu.speed.16.build.f_cpu=16000000L
Cicada-L082CZ.menu.speed.4=4.2 MHz (No USB)
Cicada-L082CZ.menu.speed.4.build.f_cpu=4200000L

Cicada-L082CZ.menu.opt.os=Smallest Code
Cicada-L082CZ.menu.opt.os.build.flags.optimize=-Os
Cicada-L082CZ.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
Cicada-L082CZ.menu.opt.o1=Fast
Cicada-L082CZ.menu.opt.o1.build.flags.optimize=-O1
Cicada-L082CZ.menu.opt.o1.build.flags.ldspecs=
Cicada-L082CZ.menu.opt.o2=Faster
Cicada-L082CZ.menu.opt.o2.build.flags.optimize=-O2
Cicada-L082CZ.menu.opt.o2.build.flags.ldspecs=
Cicada-L082CZ.menu.opt.o3=Fastest
Cicada-L082CZ.menu.opt.o3.build.flags.optimize=-O3
Cicada-L082CZ.menu.opt.o3.build.flags.ldspecs=

# IRNAS B-Colibri-L072Z
# ---------------------------------------
COLIBRI-L072Z.name=Colibri-L072Z
COLIBRI-L072Z.vid.0=0x0483
COLIBRI-L072Z.pid.0=0x374b

COLIBRI-L072Z.upload.tool=stm32l0_openocd
COLIBRI-L072Z.upload.protocol=stlink
COLIBRI-L072Z.upload.maximum_size=196608
COLIBRI-L072Z.upload.maximum_data_size=20480
COLIBRI-L072Z.upload.use_1200bps_touch=true
COLIBRI-L072Z.upload.wait_for_upload_port=false
COLIBRI-L072Z.upload.native_usb=false

COLIBRI-L072Z.build.mcu=cortex-m0plus
COLIBRI-L072Z.build.f_cpu=32000000L
COLIBRI-L072Z.build.board=STM32L0_B_L072Z_LRWAN1
COLIBRI-L072Z.build.arch=stm32l0
COLIBRI-L072Z.build.core=arduino
COLIBRI-L072Z.build.vid=0x0483
COLIBRI-L072Z.build.pid=0x374b
COLIBRI-L072Z.build.did=0xffff
COLIBRI-L072Z.build.extra_flags=-DSTM32L072xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant
COLIBRI-L072Z.build.ldscript=linker_scripts/STM32L072CZ_FLASH.ld
COLIBRI-L072Z.build.openocdscript=openocd_scripts/COLIBRI-L072Z.cfg
COLIBRI-L072Z.build.variant=COLIBRI-L072Z
COLIBRI-L072Z.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l072xx -larm_cortexM0l_math
COLIBRI-L072Z.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include" 

COLIBRI-L072Z.menu.speed.32=32 MHz
COLIBRI-L072Z.menu.speed.32.build.f_cpu=32000000L
COLIBRI-L072Z.menu.speed.16=16 MHz (No USB)
COLIBRI-L072Z.menu.speed.16.build.f_cpu=16000000L
COLIBRI-L072Z.menu.speed.4=4.2 MHz (No USB)
COLIBRI-L072Z.menu.speed.4.build.f_cpu=4200000L

COLIBRI-L072Z.menu.opt.os=Smallest Code
COLIBRI-L072Z.menu.opt.os.build.flags.optimize=-Os
COLIBRI-L072Z.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
COLIBRI-L072Z.menu.opt.o1=Fast
COLIBRI-L072Z.menu.opt.o1.build.flags.optimize=-O1
COLIBRI-L072Z.menu.opt.o1.build.flags.ldspecs=
COLIBRI-L072Z.menu.opt.o2=Faster
COLIBRI-L072Z.menu.opt.o2.build.flags.optimize=-O2
COLIBRI-L072Z.menu.opt.o2.build.flags.ldspecs=
COLIBRI-L072Z.menu.opt.o3=Fastest
COLIBRI-L072Z.menu.opt.o3.build.flags.optimize=-O3
COLIBRI-L072Z.menu.opt.o3.build.flags.ldspecs=

# IRNAS B-Colibri-L072Z
# ---------------------------------------
IRNAS-env-module-L072Z.name=IRNAS-env-module-L072Z
IRNAS-env-module-L072Z.vid.0=0x0483
IRNAS-env-module-L072Z.pid.0=0x374b

